-- phpMyAdmin SQL Dump
-- version 3.2.0.1
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2014 年 06 月 16 日 10:45
-- 服务器版本: 5.5.8
-- PHP 版本: 5.3.3

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `jiadobakedb`
--

-- --------------------------------------------------------

--
-- 表的结构 `ingres`
--

CREATE TABLE IF NOT EXISTS `ingres` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `recipeName` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `recipeId` int(11) NOT NULL,
  `metric` float NOT NULL,
  `percent` float NOT NULL,
  `requireSum` float NOT NULL DEFAULT '0',
  `sum` float NOT NULL DEFAULT '0',
  `perSum` float NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=388 ;

--
-- 转存表中的数据 `ingres`
--

INSERT INTO `ingres` (`id`, `name`, `recipeName`, `recipeId`, `metric`, `percent`, `requireSum`, `sum`, `perSum`) VALUES
(247, '面包粉-种', '食品厂老式面包的配料', 74, 6250, 31.25, 0, 45540, 227.69),
(248, '酵母-种', '食品厂老式面包的配料', 74, 50, 0.25, 0, 45540, 227.69),
(249, '水-种', '食品厂老式面包的配料', 74, 3500, 17.5, 0, 45540, 227.69),
(250, '面包粉', '食品厂老式面包的配料', 74, 20000, 100, 0, 45540, 227.69),
(251, '绵糖', '食品厂老式面包的配料', 74, 4000, 20, 0, 45540, 227.69),
(252, '酵母', '食品厂老式面包的配料', 74, 200, 1, 0, 45540, 227.69),
(253, '改良剂', '食品厂老式面包的配料', 74, 60, 0.3, 0, 45540, 227.69),
(254, '蛋', '食品厂老式面包的配料', 74, 2000, 10, 0, 45540, 227.69),
(255, '豆油', '食品厂老式面包的配料', 74, 1000, 5, 0, 45540, 227.69),
(256, '盐', '食品厂老式面包的配料', 74, 200, 1, 0, 45540, 227.69),
(257, '糖浆', '食品厂老式面包的配料', 74, 250, 1.25, 0, 45540, 227.69),
(258, '水', '食品厂老式面包的配料', 74, 8000, 40, 0, 45540, 227.69),
(259, '丙酸钙', '食品厂老式面包的配料', 74, 15, 0.07, 0, 45540, 227.69),
(260, '脱氢乙酸钠', '食品厂老式面包的配料', 74, 15, 0.07, 0, 45540, 227.69),
(261, '面包粉-种', '食品厂老式面包的配料', 74, 686.24, 31.25, 5000, 0, 227.69),
(262, '酵母-种', '食品厂老式面包的配料', 74, 5.49, 0.25, 5000, 0, 227.69),
(263, '水-种', '食品厂老式面包的配料', 74, 384.29, 17.5, 5000, 0, 227.69),
(264, '面包粉', '食品厂老式面包的配料', 74, 2195.97, 100, 5000, 0, 227.69),
(265, '绵糖', '食品厂老式面包的配料', 74, 439.19, 20, 5000, 0, 227.69),
(266, '酵母', '食品厂老式面包的配料', 74, 21.96, 1, 5000, 0, 227.69),
(267, '改良剂', '食品厂老式面包的配料', 74, 6.59, 0.3, 5000, 0, 227.69),
(268, '蛋', '食品厂老式面包的配料', 74, 219.6, 10, 5000, 0, 227.69),
(269, '豆油', '食品厂老式面包的配料', 74, 109.8, 5, 5000, 0, 227.69),
(270, '盐', '食品厂老式面包的配料', 74, 21.96, 1, 5000, 0, 227.69),
(271, '糖浆', '食品厂老式面包的配料', 74, 27.45, 1.25, 5000, 0, 227.69),
(272, '水', '食品厂老式面包的配料', 74, 878.39, 40, 5000, 0, 227.69),
(273, '丙酸钙', '食品厂老式面包的配料', 74, 1.54, 0.07, 5000, 0, 227.69),
(274, '脱氢乙酸钠', '食品厂老式面包的配料', 74, 1.54, 0.07, 5000, 0, 227.69),
(275, '面包粉', '食品厂老式面包的配料(不用老肥)', 75, 20000, 100, 0, 35740, 178.69),
(276, '绵糖', '食品厂老式面包的配料(不用老肥)', 75, 4000, 20, 0, 35740, 178.69),
(277, '酵母', '食品厂老式面包的配料(不用老肥)', 75, 200, 1, 0, 35740, 178.69),
(278, '改良剂', '食品厂老式面包的配料(不用老肥)', 75, 60, 0.3, 0, 35740, 178.69),
(279, '蛋', '食品厂老式面包的配料(不用老肥)', 75, 2000, 10, 0, 35740, 178.69),
(280, '豆油', '食品厂老式面包的配料(不用老肥)', 75, 1000, 5, 0, 35740, 178.69),
(281, '盐', '食品厂老式面包的配料(不用老肥)', 75, 200, 1, 0, 35740, 178.69),
(282, '糖浆', '食品厂老式面包的配料(不用老肥)', 75, 250, 1.25, 0, 35740, 178.69),
(283, '水', '食品厂老式面包的配料(不用老肥)', 75, 6500, 32.5, 0, 35740, 178.69),
(284, '啤酒', '食品厂老式面包的配料(不用老肥)', 75, 1500, 7.5, 0, 35740, 178.69),
(285, '丙酸钙', '食品厂老式面包的配料(不用老肥)', 75, 15, 0.07, 0, 35740, 178.69),
(286, '脱氢乙酸钠', '食品厂老式面包的配料(不用老肥)', 75, 15, 0.07, 0, 35740, 178.69),
(287, '面包粉', '食品厂老式面包的配料(不用老肥)', 75, 2630.25, 100, 4700, 0, 178.69),
(288, '绵糖', '食品厂老式面包的配料(不用老肥)', 75, 526.05, 20, 4700, 0, 178.69),
(289, '酵母', '食品厂老式面包的配料(不用老肥)', 75, 26.3, 1, 4700, 0, 178.69),
(290, '改良剂', '食品厂老式面包的配料(不用老肥)', 75, 7.89, 0.3, 4700, 0, 178.69),
(291, '蛋', '食品厂老式面包的配料(不用老肥)', 75, 263.02, 10, 4700, 0, 178.69),
(292, '豆油', '食品厂老式面包的配料(不用老肥)', 75, 131.51, 5, 4700, 0, 178.69),
(293, '盐', '食品厂老式面包的配料(不用老肥)', 75, 26.3, 1, 4700, 0, 178.69),
(294, '糖浆', '食品厂老式面包的配料(不用老肥)', 75, 32.88, 1.25, 4700, 0, 178.69),
(295, '水', '食品厂老式面包的配料(不用老肥)', 75, 854.83, 32.5, 4700, 0, 178.69),
(296, '啤酒', '食品厂老式面包的配料(不用老肥)', 75, 197.27, 7.5, 4700, 0, 178.69),
(297, '丙酸钙', '食品厂老式面包的配料(不用老肥)', 75, 1.84, 0.07, 4700, 0, 178.69),
(298, '脱氢乙酸钠', '食品厂老式面包的配料(不用老肥)', 75, 1.84, 0.07, 4700, 0, 178.69),
(299, '面包粉', '食品厂老式面包的配料(不用老肥)', 75, 2966.03, 100, 5300, 0, 178.69),
(300, '绵糖', '食品厂老式面包的配料(不用老肥)', 75, 593.21, 20, 5300, 0, 178.69),
(301, '酵母', '食品厂老式面包的配料(不用老肥)', 75, 29.66, 1, 5300, 0, 178.69),
(302, '改良剂', '食品厂老式面包的配料(不用老肥)', 75, 8.9, 0.3, 5300, 0, 178.69),
(303, '蛋', '食品厂老式面包的配料(不用老肥)', 75, 296.6, 10, 5300, 0, 178.69),
(304, '豆油', '食品厂老式面包的配料(不用老肥)', 75, 148.3, 5, 5300, 0, 178.69),
(305, '盐', '食品厂老式面包的配料(不用老肥)', 75, 29.66, 1, 5300, 0, 178.69),
(306, '糖浆', '食品厂老式面包的配料(不用老肥)', 75, 37.08, 1.25, 5300, 0, 178.69),
(307, '水', '食品厂老式面包的配料(不用老肥)', 75, 963.96, 32.5, 5300, 0, 178.69),
(308, '啤酒', '食品厂老式面包的配料(不用老肥)', 75, 222.45, 7.5, 5300, 0, 178.69),
(309, '丙酸钙', '食品厂老式面包的配料(不用老肥)', 75, 2.08, 0.07, 5300, 0, 178.69),
(310, '脱氢乙酸钠', '食品厂老式面包的配料(不用老肥)', 75, 2.08, 0.07, 5300, 0, 178.69),
(359, '白砂糖', '糖浆', 76, 400, 100, 0, 630, 157.5),
(360, '水', '糖浆', 76, 180, 45, 0, 630, 157.5),
(361, '柠檬汁', '糖浆', 76, 50, 12.5, 0, 630, 157.5),
(374, '面包粉', '健康手撕老面包-主面', 78, 20000, 100, 0, 36140, 180.69),
(375, '绵糖', '健康手撕老面包-主面', 78, 4000, 20, 0, 36140, 180.69),
(376, '酵母', '健康手撕老面包-主面', 78, 200, 1, 0, 36140, 180.69),
(377, '改良剂', '健康手撕老面包-主面', 78, 60, 0.3, 0, 36140, 180.69),
(378, '蛋', '健康手撕老面包-主面', 78, 2400, 12, 0, 36140, 180.69),
(379, '豆油', '健康手撕老面包-主面', 78, 1000, 5, 0, 36140, 180.69),
(380, '盐', '健康手撕老面包-主面', 78, 200, 1, 0, 36140, 180.69),
(381, '糖浆', '健康手撕老面包-主面', 78, 250, 1.25, 0, 36140, 180.69),
(382, '水', '健康手撕老面包-主面', 78, 8000, 40, 0, 36140, 180.69),
(383, '丙酸钙', '健康手撕老面包-主面', 78, 15, 0.07, 0, 36140, 180.69),
(384, '脱氢乙酸钠', '健康手撕老面包-主面', 78, 15, 0.07, 0, 36140, 180.69),
(385, '面包粉', '健康手撕老面包-种面', 79, 6250, 100, 0, 9800, 156.8),
(386, '酵母', '健康手撕老面包-种面', 79, 50, 0.8, 0, 9800, 156.8),
(387, '水', '健康手撕老面包-种面', 79, 3500, 56, 0, 9800, 156.8);

-- --------------------------------------------------------

--
-- 表的结构 `recipes`
--

CREATE TABLE IF NOT EXISTS `recipes` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `instructions` text COLLATE utf8_unicode_ci NOT NULL,
  `cooktime` int(11) NOT NULL,
  `temperatureU` int(11) NOT NULL,
  `temperatureD` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=80 ;

--
-- 转存表中的数据 `recipes`
--

INSERT INTO `recipes` (`id`, `name`, `instructions`, `cooktime`, `temperatureU`, `temperatureD`) VALUES
(74, '食品厂老式面包的配料', '老式面包的制作不放黄油，不放香粉，用豆油制作。\r\n老肥发酵温暖处10小时以上，有足够的酸味才好。老式面包老肥的使用量多一些效果更好，我记得以前论坛有资料介绍老肥的使用量不能超过面团总量的三成，实际上操作上和这个理论出入很大，食品厂老肥的用量很多都超过这个比例。这样做出的面包酸味更浓，效果更好。\r\n或者此方不用老肥部分，主面水分改为13斤，加入啤酒3斤，面包有啤酒的香味。', 20, 200, 166),
(75, '食品厂老式面包的配料(不用老肥)', '老式面包的制作不放黄油，不放香粉，用豆油制作。\r\n老肥发酵温暖处10小时以上，有足够的酸味才好。老式面包老肥的使用量多一些效果更好，我记得以前论坛有资料介绍老肥的使用量不能超过面团总量的三成，实际上操作上和这个理论出入很大，食品厂老肥的用量很多都超过这个比例。这样做出的面包酸味更浓，效果更好。\r\n或者此方不用老肥部分，主面水分改为13斤，加入啤酒3斤，面包有啤酒的香味。', 20, 200, 165),
(76, '糖浆', '', 0, 100, 100),
(78, '健康手撕老面包-主面', '老式面包的制作不放黄油，不放香粉，用豆油制作。\r\n老肥发酵温暖处10小时以上，有足够的酸味才好。老式面包老肥的使用量多一些效果更好，我记得以前论坛有资料介绍老肥的使用量不能超过面团总量的三成，实际上操作上和这个理论出入很大，食品厂老肥的用量很多都超过这个比例。这样做出的面包酸味更浓，效果更好。\r\n或者此方不用老肥部分，主面水分改为13斤，加入啤酒3斤，面包有啤酒的香味。', 20, 200, 165),
(79, '健康手撕老面包-种面', '老式面包的制作不放黄油，不放香粉，用豆油制作。\r\n老肥发酵温暖处10小时以上，有足够的酸味才好。老式面包老肥的使用量多一些效果更好，我记得以前论坛有资料介绍老肥的使用量不能超过面团总量的三成，实际上操作上和这个理论出入很大，食品厂老肥的用量很多都超过这个比例。这样做出的面包酸味更浓，效果更好。\r\n或者此方不用老肥部分，主面水分改为13斤，加入啤酒3斤，面包有啤酒的香味。', 20, 200, 166);

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE IF NOT EXISTS `user` (
  `user_id` int(11) NOT NULL,
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(20) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `user`
--

