-- phpMyAdmin SQL Dump
-- version 2.11.11.3
-- http://www.phpmyadmin.net
--
-- 主机: mysql1.webcrow-php.netowl.jp
-- 生成日期: 2014 年 06 月 16 日 19:40
-- 服务器版本: 5.0.95
-- PHP 版本: 5.3.3

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `jiadaobake_database`
--
CREATE DATABASE `jiadaobake_database` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `jiadaobake_database`;

-- --------------------------------------------------------

--
-- 表的结构 `ingres`
--

CREATE TABLE IF NOT EXISTS `ingres` (
  `id` int(11) NOT NULL auto_increment,
  `name` varchar(100) collate utf8_unicode_ci NOT NULL,
  `recipeName` varchar(100) collate utf8_unicode_ci NOT NULL,
  `recipeId` int(11) NOT NULL,
  `metric` float NOT NULL,
  `percent` float NOT NULL,
  `requireSum` float NOT NULL default '0',
  `sum` float NOT NULL default '0',
  `perSum` float NOT NULL default '0',
  PRIMARY KEY  (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=382 ;

--
-- 导出表中的数据 `ingres`
--

INSERT INTO `ingres` (`id`, `name`, `recipeName`, `recipeId`, `metric`, `percent`, `requireSum`, `sum`, `perSum`) VALUES
(215, '面', '无可奈何花落去 ', 72, 525, 100, 0, 769, 146.48),
(216, '水', '无可奈何花落去 ', 72, 244, 46.48, 0, 769, 146.48),
(217, '面', '垃圾', 73, 525, 100, 0, 824, 156.96),
(218, '水', '垃圾', 73, 244, 46.48, 0, 824, 156.96),
(219, '油', '垃圾', 73, 55, 10.48, 0, 824, 156.96),
(238, '面', '无可奈何花落去 ', 72, 546.15, 100, 800, 0, 146.48),
(239, '水', '无可奈何花落去 ', 72, 253.85, 46.48, 800, 0, 146.48),
(242, '面', '垃圾', 73, 509.68, 100, 800, 0, 156.96),
(243, '水', '垃圾', 73, 236.9, 46.48, 800, 0, 156.96),
(244, '油', '垃圾', 73, 53.41, 10.48, 800, 0, 156.96),
(245, '面', '无可奈何花落去 ', 72, 587.11, 100, 860, 0, 146.48),
(246, '水', '无可奈何花落去 ', 72, 272.89, 46.48, 860, 0, 146.48),
(247, '面包粉-种', '食品厂老式面包的配料', 74, 6250, 31.25, 0, 45540, 227.69),
(248, '酵母-种', '食品厂老式面包的配料', 74, 50, 0.25, 0, 45540, 227.69),
(249, '水-种', '食品厂老式面包的配料', 74, 3500, 17.5, 0, 45540, 227.69),
(250, '面包粉', '食品厂老式面包的配料', 74, 20000, 100, 0, 45540, 227.69),
(251, '绵糖', '食品厂老式面包的配料', 74, 4000, 20, 0, 45540, 227.69),
(252, '酵母', '食品厂老式面包的配料', 74, 200, 1, 0, 45540, 227.69),
(253, '改良剂', '食品厂老式面包的配料', 74, 60, 0.3, 0, 45540, 227.69),
(254, '蛋', '食品厂老式面包的配料', 74, 2000, 10, 0, 45540, 227.69),
(255, '豆油', '食品厂老式面包的配料', 74, 1000, 5, 0, 45540, 227.69),
(256, '盐', '食品厂老式面包的配料', 74, 200, 1, 0, 45540, 227.69),
(257, '糖浆', '食品厂老式面包的配料', 74, 250, 1.25, 0, 45540, 227.69),
(258, '水', '食品厂老式面包的配料', 74, 8000, 40, 0, 45540, 227.69),
(259, '丙酸钙', '食品厂老式面包的配料', 74, 15, 0.07, 0, 45540, 227.69),
(260, '脱氢乙酸钠', '食品厂老式面包的配料', 74, 15, 0.07, 0, 45540, 227.69),
(261, '面包粉-种', '食品厂老式面包的配料', 74, 686.24, 31.25, 5000, 0, 227.69),
(262, '酵母-种', '食品厂老式面包的配料', 74, 5.49, 0.25, 5000, 0, 227.69),
(263, '水-种', '食品厂老式面包的配料', 74, 384.29, 17.5, 5000, 0, 227.69),
(264, '面包粉', '食品厂老式面包的配料', 74, 2195.97, 100, 5000, 0, 227.69),
(265, '绵糖', '食品厂老式面包的配料', 74, 439.19, 20, 5000, 0, 227.69),
(266, '酵母', '食品厂老式面包的配料', 74, 21.96, 1, 5000, 0, 227.69),
(267, '改良剂', '食品厂老式面包的配料', 74, 6.59, 0.3, 5000, 0, 227.69),
(268, '蛋', '食品厂老式面包的配料', 74, 219.6, 10, 5000, 0, 227.69),
(269, '豆油', '食品厂老式面包的配料', 74, 109.8, 5, 5000, 0, 227.69),
(270, '盐', '食品厂老式面包的配料', 74, 21.96, 1, 5000, 0, 227.69),
(271, '糖浆', '食品厂老式面包的配料', 74, 27.45, 1.25, 5000, 0, 227.69),
(272, '水', '食品厂老式面包的配料', 74, 878.39, 40, 5000, 0, 227.69),
(273, '丙酸钙', '食品厂老式面包的配料', 74, 1.54, 0.07, 5000, 0, 227.69),
(274, '脱氢乙酸钠', '食品厂老式面包的配料', 74, 1.54, 0.07, 5000, 0, 227.69),
(275, '面包粉', '食品厂老式面包的配料(不用老肥)', 75, 20000, 100, 0, 35740, 178.69),
(276, '绵糖', '食品厂老式面包的配料(不用老肥)', 75, 4000, 20, 0, 35740, 178.69),
(277, '酵母', '食品厂老式面包的配料(不用老肥)', 75, 200, 1, 0, 35740, 178.69),
(278, '改良剂', '食品厂老式面包的配料(不用老肥)', 75, 60, 0.3, 0, 35740, 178.69),
(279, '蛋', '食品厂老式面包的配料(不用老肥)', 75, 2000, 10, 0, 35740, 178.69),
(280, '豆油', '食品厂老式面包的配料(不用老肥)', 75, 1000, 5, 0, 35740, 178.69),
(281, '盐', '食品厂老式面包的配料(不用老肥)', 75, 200, 1, 0, 35740, 178.69),
(282, '糖浆', '食品厂老式面包的配料(不用老肥)', 75, 250, 1.25, 0, 35740, 178.69),
(283, '水', '食品厂老式面包的配料(不用老肥)', 75, 6500, 32.5, 0, 35740, 178.69),
(284, '啤酒', '食品厂老式面包的配料(不用老肥)', 75, 1500, 7.5, 0, 35740, 178.69),
(285, '丙酸钙', '食品厂老式面包的配料(不用老肥)', 75, 15, 0.07, 0, 35740, 178.69),
(286, '脱氢乙酸钠', '食品厂老式面包的配料(不用老肥)', 75, 15, 0.07, 0, 35740, 178.69),
(287, '面包粉', '食品厂老式面包的配料(不用老肥)', 75, 2630.25, 100, 4700, 0, 178.69),
(288, '绵糖', '食品厂老式面包的配料(不用老肥)', 75, 526.05, 20, 4700, 0, 178.69),
(289, '酵母', '食品厂老式面包的配料(不用老肥)', 75, 26.3, 1, 4700, 0, 178.69),
(290, '改良剂', '食品厂老式面包的配料(不用老肥)', 75, 7.89, 0.3, 4700, 0, 178.69),
(291, '蛋', '食品厂老式面包的配料(不用老肥)', 75, 263.02, 10, 4700, 0, 178.69),
(292, '豆油', '食品厂老式面包的配料(不用老肥)', 75, 131.51, 5, 4700, 0, 178.69),
(293, '盐', '食品厂老式面包的配料(不用老肥)', 75, 26.3, 1, 4700, 0, 178.69),
(294, '糖浆', '食品厂老式面包的配料(不用老肥)', 75, 32.88, 1.25, 4700, 0, 178.69),
(295, '水', '食品厂老式面包的配料(不用老肥)', 75, 854.83, 32.5, 4700, 0, 178.69),
(296, '啤酒', '食品厂老式面包的配料(不用老肥)', 75, 197.27, 7.5, 4700, 0, 178.69),
(297, '丙酸钙', '食品厂老式面包的配料(不用老肥)', 75, 1.84, 0.07, 4700, 0, 178.69),
(298, '脱氢乙酸钠', '食品厂老式面包的配料(不用老肥)', 75, 1.84, 0.07, 4700, 0, 178.69),
(299, '面包粉', '食品厂老式面包的配料(不用老肥)', 75, 3637.58, 100, 6500, 0, 178.69),
(300, '绵糖', '食品厂老式面包的配料(不用老肥)', 75, 727.52, 20, 6500, 0, 178.69),
(301, '酵母', '食品厂老式面包的配料(不用老肥)', 75, 36.38, 1, 6500, 0, 178.69),
(302, '改良剂', '食品厂老式面包的配料(不用老肥)', 75, 10.91, 0.3, 6500, 0, 178.69),
(303, '蛋', '食品厂老式面包的配料(不用老肥)', 75, 363.76, 10, 6500, 0, 178.69),
(304, '豆油', '食品厂老式面包的配料(不用老肥)', 75, 181.88, 5, 6500, 0, 178.69),
(305, '盐', '食品厂老式面包的配料(不用老肥)', 75, 36.38, 1, 6500, 0, 178.69),
(306, '糖浆', '食品厂老式面包的配料(不用老肥)', 75, 45.47, 1.25, 6500, 0, 178.69),
(307, '水', '食品厂老式面包的配料(不用老肥)', 75, 1182.21, 32.5, 6500, 0, 178.69),
(308, '啤酒', '食品厂老式面包的配料(不用老肥)', 75, 272.82, 7.5, 6500, 0, 178.69),
(309, '丙酸钙', '食品厂老式面包的配料(不用老肥)', 75, 2.55, 0.07, 6500, 0, 178.69),
(310, '脱氢乙酸钠', '食品厂老式面包的配料(不用老肥)', 75, 2.55, 0.07, 6500, 0, 178.69),
(311, '面包粉', '食品厂老式面包的配料(不用老肥)', 75, 2518.33, 100, 4500, 0, 178.69),
(312, '绵糖', '食品厂老式面包的配料(不用老肥)', 75, 503.67, 20, 4500, 0, 178.69),
(313, '酵母', '食品厂老式面包的配料(不用老肥)', 75, 25.18, 1, 4500, 0, 178.69),
(314, '改良剂', '食品厂老式面包的配料(不用老肥)', 75, 7.55, 0.3, 4500, 0, 178.69),
(315, '蛋', '食品厂老式面包的配料(不用老肥)', 75, 251.83, 10, 4500, 0, 178.69),
(316, '豆油', '食品厂老式面包的配料(不用老肥)', 75, 125.92, 5, 4500, 0, 178.69),
(317, '盐', '食品厂老式面包的配料(不用老肥)', 75, 25.18, 1, 4500, 0, 178.69),
(318, '糖浆', '食品厂老式面包的配料(不用老肥)', 75, 31.48, 1.25, 4500, 0, 178.69),
(319, '水', '食品厂老式面包的配料(不用老肥)', 75, 818.46, 32.5, 4500, 0, 178.69),
(320, '啤酒', '食品厂老式面包的配料(不用老肥)', 75, 188.87, 7.5, 4500, 0, 178.69),
(321, '丙酸钙', '食品厂老式面包的配料(不用老肥)', 75, 1.76, 0.07, 4500, 0, 178.69),
(322, '脱氢乙酸钠', '食品厂老式面包的配料(不用老肥)', 75, 1.76, 0.07, 4500, 0, 178.69),
(329, '面', '老式老肥', 78, 6250, 100, 0, 9800, 156.8),
(330, '酵母', '老式老肥', 78, 50, 0.8, 0, 9800, 156.8),
(331, '水', '老式老肥', 78, 3500, 56, 0, 9800, 156.8),
(332, '面', '老式老肥', 78, 1562.5, 100, 2450, 0, 156.8),
(333, '酵母', '老式老肥', 78, 12.5, 0.8, 2450, 0, 156.8),
(334, '水', '老式老肥', 78, 875, 56, 2450, 0, 156.8),
(347, '面', '老式老肥', 78, 1339.29, 100, 2100, 0, 156.8),
(348, '酵母', '老式老肥', 78, 10.71, 0.8, 2100, 0, 156.8),
(349, '水', '老式老肥', 78, 750, 56, 2100, 0, 156.8),
(350, '面', '无可奈何花落去 ', 72, 2500, 100, 3662, 0, 146.48),
(351, '水', '无可奈何花落去 ', 72, 1162, 46.48, 3662, 0, 146.48),
(352, '面包粉', '食品厂老式面包的配料(不用老肥)', 75, 1371.09, 100, 2450, 0, 178.69),
(353, '绵糖', '食品厂老式面包的配料(不用老肥)', 75, 274.22, 20, 2450, 0, 178.69),
(354, '酵母', '食品厂老式面包的配料(不用老肥)', 75, 13.71, 1, 2450, 0, 178.69),
(355, '改良剂', '食品厂老式面包的配料(不用老肥)', 75, 4.11, 0.3, 2450, 0, 178.69),
(356, '蛋', '食品厂老式面包的配料(不用老肥)', 75, 137.11, 10, 2450, 0, 178.69),
(357, '豆油', '食品厂老式面包的配料(不用老肥)', 75, 68.55, 5, 2450, 0, 178.69),
(358, '盐', '食品厂老式面包的配料(不用老肥)', 75, 13.71, 1, 2450, 0, 178.69),
(359, '糖浆', '食品厂老式面包的配料(不用老肥)', 75, 17.14, 1.25, 2450, 0, 178.69),
(360, '水', '食品厂老式面包的配料(不用老肥)', 75, 445.6, 32.5, 2450, 0, 178.69),
(361, '啤酒', '食品厂老式面包的配料(不用老肥)', 75, 102.83, 7.5, 2450, 0, 178.69),
(362, '丙酸钙', '食品厂老式面包的配料(不用老肥)', 75, 0.96, 0.07, 2450, 0, 178.69),
(363, '脱氢乙酸钠', '食品厂老式面包的配料(不用老肥)', 75, 0.96, 0.07, 2450, 0, 178.69),
(364, '糖', '糖浆', 79, 400, 100, 0, 630, 157.5),
(365, '水', '糖浆', 79, 180, 45, 0, 630, 157.5),
(366, '柠檬汁', '糖浆', 79, 50, 12.5, 0, 630, 157.5),
(367, '糖', '糖浆', 79, 12.7, 100, 20, 0, 157.5),
(368, '水', '糖浆', 79, 5.71, 45, 20, 0, 157.5),
(369, '柠檬汁', '糖浆', 79, 1.59, 12.5, 20, 0, 157.5),
(370, '低粉', '小海绵', 80, 386, 100, 0, 2325.2, 602.39),
(371, '淀粉', '小海绵', 80, 26, 6.74, 0, 2325.2, 602.39),
(372, 'TT', '小海绵', 80, 12, 3.11, 0, 2325.2, 602.39),
(373, '盐', '小海绵', 80, 5, 1.3, 0, 2325.2, 602.39),
(374, '香草', '小海绵', 80, 4, 1.04, 0, 2325.2, 602.39),
(375, '砂糖1', '小海绵', 80, 295, 76.42, 0, 2325.2, 602.39),
(376, '砂糖2', '小海绵', 80, 126, 32.64, 0, 2325.2, 602.39),
(377, 'B.P', '小海绵', 80, 3.2, 0.83, 0, 2325.2, 602.39),
(378, '蛋白', '小海绵', 80, 800, 207.25, 0, 2325.2, 602.39),
(379, '蛋黄', '小海绵', 80, 398, 103.11, 0, 2325.2, 602.39),
(380, '色拉油', '小海绵', 80, 152, 39.38, 0, 2325.2, 602.39),
(381, '水', '小海绵', 80, 118, 30.57, 0, 2325.2, 602.39);

-- --------------------------------------------------------

--
-- 表的结构 `recipes`
--

CREATE TABLE IF NOT EXISTS `recipes` (
  `id` int(11) NOT NULL auto_increment,
  `name` varchar(100) collate utf8_unicode_ci NOT NULL,
  `instructions` text collate utf8_unicode_ci NOT NULL,
  `cooktime` int(11) NOT NULL,
  `temperatureU` int(11) NOT NULL,
  `temperatureD` int(11) NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=81 ;

--
-- 导出表中的数据 `recipes`
--

INSERT INTO `recipes` (`id`, `name`, `instructions`, `cooktime`, `temperatureU`, `temperatureD`) VALUES
(72, '无可奈何花落去 ', '先搅拌，后烘烤', 30, 160, 190),
(73, '垃圾', '', 0, 100, 100),
(74, '食品厂老式面包的配料', '老式面包的制作不放黄油，不放香粉，用豆油制作。\r\n老肥发酵温暖处10小时以上，有足够的酸味才好。老式面包老肥的使用量多一些效果更好，我记得以前论坛有资料介绍老肥的使用量不能超过面团总量的三成，实际上操作上和这个理论出入很大，食品厂老肥的用量很多都超过这个比例。这样做出的面包酸味更浓，效果更好。\r\n或者此方不用老肥部分，主面水分改为13斤，加入啤酒3斤，面包有啤酒的香味。', 20, 200, 166),
(75, '食品厂老式面包的配料(不用老肥)', '老式面包的制作不放黄油，不放香粉，用豆油制作。\r\n老肥发酵温暖处10小时以上，有足够的酸味才好。老式面包老肥的使用量多一些效果更好，我记得以前论坛有资料介绍老肥的使用量不能超过面团总量的三成，实际上操作上和这个理论出入很大，食品厂老肥的用量很多都超过这个比例。这样做出的面包酸味更浓，效果更好。\r\n或者此方不用老肥部分，主面水分改为13斤，加入啤酒3斤，面包有啤酒的香味。', 40, 150, 175),
(78, '老式老肥', '', 0, 100, 100),
(79, '糖浆', '', 0, 100, 100),
(80, '小海绵', '', 24, 195, 160);
